In [1]:
# Import Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from ast import literal_eval

In [2]:
# import and read dataset (train data) from csv file
file_path = "Resources/train.csv"
movies_df = pd.read_csv(file_path)

In [3]:
# check table
movies_df.head()

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
0,1,"[{'id': 313576, 'name': 'Hot Tub Time Machine ...",14000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2637294,en,Hot Tub Time Machine 2,"When Lou, who has become the ""father of the In...",6.575393,...,2/20/15,93.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The Laws of Space and Time are About to be Vio...,Hot Tub Time Machine 2,"[{'id': 4379, 'name': 'time travel'}, {'id': 9...","[{'cast_id': 4, 'character': 'Lou', 'credit_id...","[{'credit_id': '59ac067c92514107af02c8c8', 'de...",12314651
1,2,"[{'id': 107674, 'name': 'The Princess Diaries ...",40000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0368933,en,The Princess Diaries 2: Royal Engagement,Mia Thermopolis is now a college graduate and ...,8.248895,...,8/6/04,113.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,It can take a lifetime to find true love; she'...,The Princess Diaries 2: Royal Engagement,"[{'id': 2505, 'name': 'coronation'}, {'id': 42...","[{'cast_id': 1, 'character': 'Mia Thermopolis'...","[{'credit_id': '52fe43fe9251416c7502563d', 'de...",95149435
2,3,NaN,3300000,"[{'id': 18, 'name': 'Drama'}]",http://sonyclassics.com/whiplash/,tt2582802,en,Whiplash,"Under the direction of a ruthless instructor, ...",64.299990,...,10/10/14,105.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The road to greatness can take you to the edge.,Whiplash,"[{'id': 1416, 'name': 'jazz'}, {'id': 1523, 'n...","[{'cast_id': 5, 'character': 'Andrew Neimann',...","[{'credit_id': '54d5356ec3a3683ba0000039', 'de...",13092000
3,4,NaN,1200000,"[{'id': 53, 'name': 'Thriller'}, {'id': 18, 'n...",http://kahaanithefilm.com/,tt1821480,hi,Kahaani,Vidya Bagchi (Vidya Balan) arrives in Kolkata ...,3.174936,...,3/9/12,122.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,NaN,Kahaani,"[{'id': 10092, 'name': 'mystery'}, {'id': 1054...","[{'cast_id': 1, 'character': 'Vidya Bagchi', '...","[{'credit_id': '52fe48779251416c9108d6eb', 'de...",16000000
4,5,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...",NaN,tt1380152,ko,마린보이,Marine Boy is the story of a former national s...,1.148070,...,2/5/09,118.0,"[{'iso_639_1': 'ko', 'name': '한국어/조선말'}]",Released,NaN,Marine Boy,NaN,"[{'cast_id': 3, 'character': 'Chun-soo', 'cred...","[{'credit_id': '52fe464b9251416c75073b43', 'de...",3923970

In [4]:
# Make an empty dict to hold all of the alternative titles.
def clean_genres(movie):
    if pd.isna(movie):
        return np.nan
    l=[]
    movie=literal_eval(movie)
    for i in movie:
        l.append(i['name'])
    return l
movies_df['new_genre']=movies_df['genres'].apply(clean_genres)

In [5]:
movies_df.head(2)

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue,new_genre
0,1,"[{'id': 313576, 'name': 'Hot Tub Time Machine ...",14000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2637294,en,Hot Tub Time Machine 2,"When Lou, who has become the ""father of the In...",6.575393,...,93.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The Laws of Space and Time are About to be Vio...,Hot Tub Time Machine 2,"[{'id': 4379, 'name': 'time travel'}, {'id': 9...","[{'cast_id': 4, 'character': 'Lou', 'credit_id...","[{'credit_id': '59ac067c92514107af02c8c8', 'de...",12314651,[Comedy]
1,2,"[{'id': 107674, 'name': 'The Princess Diaries ...",40000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0368933,en,The Princess Diaries 2: Royal Engagement,Mia Thermopolis is now a college graduate and ...,8.248895,...,113.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,It can take a lifetime to find true love; she'...,The Princess Diaries 2: Royal Engagement,"[{'id': 2505, 'name': 'coronation'}, {'id': 42...","[{'cast_id': 1, 'character': 'Mia Thermopolis'...","[{'credit_id': '52fe43fe9251416c7502563d', 'de...",95149435,"[Comedy, Drama, Family, Romance]"

In [6]:
# drop any null values of new_genre by using the dropna() method. 
# movies_df2 = movies_df.dropna(axis = 0, how='any',subset=["new_genre"], inplace=True)

movies_df2 = movies_df.dropna(subset=["new_genre"])

In [7]:
# check how many rows and columns
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2993 entries, 0 to 2999
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     2993 non-null   int64
 1   belongs_to_collection  604 non-null    object
 2   budget                 2993 non-null   int64
 3   genres                 2993 non-null   object
 4   homepage               945 non-null    object
 5   imdb_id                2993 non-null   object
 6   original_language      2993 non-null   object
 7   original_title         2993 non-null   object
 8   overview               2985 non-null   object
 9   popularity             2993 non-null   float64
 10  poster_path            2992 non-null   object
 11  production_companies   2844 non-null   object
 12  production_countries   2941 non-null   object
 13  release_date           2993 non-null   object
 14  runtime                2991 non-null   float64
 15  spoken_languages       2976 non-null   object
 16  status                 2993 non-null   object
 17  tagline                2402 non-null   object
 18  title                  2993 non-null   object
 19  Keywords               2722 non-null   object
 20  cast                   2980 non-null   object
 21  crew                   2978 non-null   object
 22  revenue                2993 non-null   int64
 23  new_genre              2993 non-null   object
dtypes: float64(2), int64(3), object(19)
memory usage: 584.6+ KB

In [14]:
# convert list into multiple columns
temp = pd.DataFrame(movies_df2['new_genre'].to_list(), columns = ['Genre_1', 'Genre_2', 'Genre_3','Genre_4', 'Genre_5','Genre_6','Genre_7'])
temp

       Genre_1   Genre_2  Genre_3   Genre_4 Genre_5 Genre_6 Genre_7
0       Comedy      None     None      None    None    None    None
1       Comedy     Drama   Family   Romance    None    None    None
2        Drama      None     None      None    None    None    None
3     Thriller     Drama     None      None    None    None    None
4       Action  Thriller     None      None    None    None    None
...        ...       ...      ...       ...     ...     ...     ...
2988    Comedy   Romance     None      None    None    None    None
2989     Drama     Music     None      None    None    None    None
2990     Crime    Action  Mystery  Thriller    None    None    None
2991    Comedy   Romance     None      None    None    None    None
2992  Thriller    Action  Mystery      None    None    None    None

[2993 rows x 7 columns]

In [15]:
# check null values for temp dataframe (c1 CANNOT have null values)
temp.isna().sum()

Genre_1       0
Genre_2     593
Genre_3    1565
Genre_4    2465
Genre_5    2858
Genre_6    2969
Genre_7    2990
dtype: int64

In [16]:

# # concat with movies_df
    # axis = 1 for columns
    # reset index to properly match each table.
new_df = pd.concat([movies_df2.reset_index(drop=True),temp.reset_index(drop=True)],axis=1)

In [11]:
# check null values for new_df dataframe (c1 CANNOT have null values)
new_df

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,crew,revenue,new_genre,c1,c2,c3,c4,c5,c6,c7
0,1,"[{'id': 313576, 'name': 'Hot Tub Time Machine ...",14000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2637294,en,Hot Tub Time Machine 2,"When Lou, who has become the ""father of the In...",6.575393,...,"[{'credit_id': '59ac067c92514107af02c8c8', 'de...",12314651,[Comedy],Comedy,None,None,None,None,None,None
1,2,"[{'id': 107674, 'name': 'The Princess Diaries ...",40000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0368933,en,The Princess Diaries 2: Royal Engagement,Mia Thermopolis is now a college graduate and ...,8.248895,...,"[{'credit_id': '52fe43fe9251416c7502563d', 'de...",95149435,"[Comedy, Drama, Family, Romance]",Comedy,Drama,Family,Romance,None,None,None
2,3,NaN,3300000,"[{'id': 18, 'name': 'Drama'}]",http://sonyclassics.com/whiplash/,tt2582802,en,Whiplash,"Under the direction of a ruthless instructor, ...",64.299990,...,"[{'credit_id': '54d5356ec3a3683ba0000039', 'de...",13092000,[Drama],Drama,None,None,None,None,None,None
3,4,NaN,1200000,"[{'id': 53, 'name': 'Thriller'}, {'id': 18, 'n...",http://kahaanithefilm.com/,tt1821480,hi,Kahaani,Vidya Bagchi (Vidya Balan) arrives in Kolkata ...,3.174936,...,"[{'credit_id': '52fe48779251416c9108d6eb', 'de...",16000000,"[Thriller, Drama]",Thriller,Drama,None,None,None,None,None
4,5,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...",NaN,tt1380152,ko,마린보이,Marine Boy is the story of a former national s...,1.148070,...,"[{'credit_id': '52fe464b9251416c75073b43', 'de...",3923970,"[Action, Thriller]",Action,Thriller,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2988,2996,NaN,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",NaN,tt0109403,en,Chasers,Military men Rock Reilly and Eddie Devane are ...,9.853270,...,"[{'credit_id': '52fe4494c3a368484e02ac7d', 'de...",1596687,"[Comedy, Romance]",Comedy,Romance,None,None,None,None,None
2989,2997,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,tt2364975,sv,Vi är bäst!,Three girls in 1980s Stockholm decide to form ...,3.727996,...,"[{'credit_id': '5716b72ac3a3686678012c84', 'de...",180590,"[Drama, Music]",Drama,Music,None,None,None,None,None
2990,2998,NaN,65000000,"[{'id': 80, 'name': 'Crime'}, {'id': 28, 'name...",NaN,tt0116908,en,The Long Kiss Goodnight,"Samantha Caine, suburban homemaker, is the ide...",14.482345,...,"[{'credit_id': '52fe443a9251416c7502d579', 'de...",89456761,"[Crime, Action, Mystery, Thriller]",Crime,Action,Mystery,Thriller,None,None,None
2991,2999,NaN,42000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",http://www.alongcamepolly.com/,tt0343135,en,Along Came Polly,Reuben Feffer is a guy who's spent his entire ...,15.725542,...,"[{'credit_id': '556f817b9251410866000a63', 'de...",171963386,"[Comedy, Romance]",Comedy,Romance,None,None,None,None,None
2992,3000,NaN,35000000,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",http://www.abductionthefilm.com/,tt1600195,en,Abduction,A young man sets out to uncover the truth abou...,10.512109,...,"[{'credit_id': '5391990d0e0a260fb5001629', 'de...",82087155,"[Thriller, Action, Mystery]",Thriller,Action,Mystery,None,None,None,None

In [17]:
# add column has_collection with numerical values instead of text from belongs_to_collection
new_df["has_collection"] = [0 if pd.isnull(x) else 1 for x in new_df["belongs_to_collection"]]

In [18]:
# Check dataframe
new_df

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,revenue,new_genre,Genre_1,Genre_2,Genre_3,Genre_4,Genre_5,Genre_6,Genre_7,has_collection
0,1,"[{'id': 313576, 'name': 'Hot Tub Time Machine ...",14000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2637294,en,Hot Tub Time Machine 2,"When Lou, who has become the ""father of the In...",6.575393,...,12314651,[Comedy],Comedy,None,None,None,None,None,None,1
1,2,"[{'id': 107674, 'name': 'The Princess Diaries ...",40000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0368933,en,The Princess Diaries 2: Royal Engagement,Mia Thermopolis is now a college graduate and ...,8.248895,...,95149435,"[Comedy, Drama, Family, Romance]",Comedy,Drama,Family,Romance,None,None,None,1
2,3,NaN,3300000,"[{'id': 18, 'name': 'Drama'}]",http://sonyclassics.com/whiplash/,tt2582802,en,Whiplash,"Under the direction of a ruthless instructor, ...",64.299990,...,13092000,[Drama],Drama,None,None,None,None,None,None,0
3,4,NaN,1200000,"[{'id': 53, 'name': 'Thriller'}, {'id': 18, 'n...",http://kahaanithefilm.com/,tt1821480,hi,Kahaani,Vidya Bagchi (Vidya Balan) arrives in Kolkata ...,3.174936,...,16000000,"[Thriller, Drama]",Thriller,Drama,None,None,None,None,None,0
4,5,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...",NaN,tt1380152,ko,마린보이,Marine Boy is the story of a former national s...,1.148070,...,3923970,"[Action, Thriller]",Action,Thriller,None,None,None,None,None,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2988,2996,NaN,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",NaN,tt0109403,en,Chasers,Military men Rock Reilly and Eddie Devane are ...,9.853270,...,1596687,"[Comedy, Romance]",Comedy,Romance,None,None,None,None,None,0
2989,2997,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,tt2364975,sv,Vi är bäst!,Three girls in 1980s Stockholm decide to form ...,3.727996,...,180590,"[Drama, Music]",Drama,Music,None,None,None,None,None,0
2990,2998,NaN,65000000,"[{'id': 80, 'name': 'Crime'}, {'id': 28, 'name...",NaN,tt0116908,en,The Long Kiss Goodnight,"Samantha Caine, suburban homemaker, is the ide...",14.482345,...,89456761,"[Crime, Action, Mystery, Thriller]",Crime,Action,Mystery,Thriller,None,None,None,0
2991,2999,NaN,42000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",http://www.alongcamepolly.com/,tt0343135,en,Along Came Polly,Reuben Feffer is a guy who's spent his entire ...,15.725542,...,171963386,"[Comedy, Romance]",Comedy,Romance,None,None,None,None,None,0
2992,3000,NaN,35000000,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",http://www.abductionthefilm.com/,tt1600195,en,Abduction,A young man sets out to uncover the truth abou...,10.512109,...,82087155,"[Thriller, Action, Mystery]",Thriller,Action,Mystery,None,None,None,None,0

# Connecting Pandas and SQL

In [19]:
# import modules
from sqlalchemy import create_engine
from config import db_password

In [20]:
# Create the Database Engine
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/IMBD_Movie_Data"

engine = create_engine(db_string)
# pip install psycopg2-binary to access module named 'psycopg2'

# Import the Movie Data

In [21]:
#  save the movies_df DataFrame to a SQL table
movies_df.to_sql(name='Movies', con=engine)